src/InformationRegisters/ИспользоватьУтверждениеДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ИспользоватьУтверждениеДокументов</Name>
			<Comment>Активация использования утверждения документов для каждого документа</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОтклонениеПриОтменеПроведения</Name>
					<Comment>Устанавливать статус "Отклонен" (если истина) или "Согласован" (если ложь) при отмене проведения документа</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Использовать</Name>
					<Comment>Признак использования документа</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Напоминать</Name>
					<Comment>Флаг напоминания пользователю об изменении статуса документа</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Comment>Полное имя документа</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/НастройкиУтвержденияДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>НастройкиУтвержденияДокументов</Name>
			<Comment>Настройка прав пользователей по утверждению документов</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Согласован</Name>
					<Comment>Разрешение устанавливать статус "Согласован"</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Утвержден</Name>
					<Comment>Разрешение устанавливать статус "Утвержден"</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>Объект, на уровне которого производится настройка</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.ГруппыДоступа</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Comment>Полное имя документа</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/СтатусыДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>СтатусыДокументов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеУстановлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подготовка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подготовлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Согласован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Утвержден</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклонен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/ГруппыДоступа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ГруппыДоступа</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Comment>Только для персональных групп доступа</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.ВнешниеПользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнаяГруппаДоступаПоставляемогоПрофиля</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФильтроватьДокументыПоПользователю</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Пользователи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
								<v8:Type>cfg:CatalogRef.ВнешниеПользователи</v8:Type>
								<v8:Type>cfg:CatalogRef.ГруппыВнешнихПользователей</v8:Type>
								<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВидыДоступа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидДоступа</Name>
							<Comment>Представлен пустой ссылкой основного типа значений</Comment>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЗначениеДоступа</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВсеРазрешены</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Профиль</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПрофилиГруппДоступа</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЗначенияДоступа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидДоступа</Name>
							<Comment>Представлен пустой ссылкой основного типа значений</Comment>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЗначениеДоступа</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеДоступа</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЗначениеДоступа</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Профиль</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПрофилиГруппДоступа</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоступПоИерархии</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПрофилиДоступа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Профиль</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПрофилиГруппДоступа</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/CommonModules/УтверждениеДокументовПовтИсп/Ext/Module.bsl
// Общий модуль "Утверждение документов (повторного использования)"

// Проверяет участие документа в подсистеме утверждения, получает режим отмены проведения.
//
// Параметры:
//  Документ   - Строка  - Полное имя документа, для которого производится проверка.
//
// Возвращаемое значение:
//  ОтклонениеПриОтменеПроведения - Булево - Истина: при отмене проведения уст. статус «Отклонен», Ложь: «Согласован».
//  Булево  - Участие документа в подсистеме утверждения: Истина - участвует, Ложь - статус не контролируется.
//
Функция КонтролироватьУтверждениеДокумента(Документ, ОтклонениеПриОтменеПроведения = Ложь) Экспорт
	
	ДокументУчаствуетВУтверждении = Ложь;
	ОтклонениеПриОтменеПроведения = Ложь;
	
	// Получаем значение настройки ОтклонениеПриОтменеПроведения из регистра для текущего документа.
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ИспользоватьУтверждениеДокументов.ОтклонениеПриОтменеПроведения
	                      |ИЗ
	                      |	РегистрСведений.ИспользоватьУтверждениеДокументов КАК ИспользоватьУтверждениеДокументов
	                      |ГДЕ
	                      |	ИспользоватьУтверждениеДокументов.Документ = &Документ
	                      |	И ИспользоватьУтверждениеДокументов.Использовать = ИСТИНА");
	Запрос.УстановитьПараметр("Документ", Документ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
		ДокументУчаствуетВУтверждении = Истина;
		ОтклонениеПриОтменеПроведения = Выборка.ОтклонениеПриОтменеПроведения;
	КонецЕсли;
	
	Возврат ДокументУчаствуетВУтверждении;
	
КонецФункции // ИспользоватьУтверждениеДокументов()

// Формирует список доступных статусов утверждения документа.
//
// Параметры:
//  Документ      - Строка - Полное имя документа (из метаданных), для которого выбираются доступные статусы.
//
// Возвращаемое значение:
//   Соответствие  - Перечень доступных статусов утверждения для пользователя/группы доступа.
//
Функция ДоступныеСтатусы(Документ) Экспорт
	
	ДоступныеСтатусы = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(ГруппыДоступаПользователи.Ссылка) КАК Количество
		|ПОМЕСТИТЬ КоличествоГруппДоступа
		|ИЗ
		|	Справочник.ГруппыДоступа.Пользователи КАК ГруппыДоступаПользователи
		|ГДЕ
		|	ГруппыДоступаПользователи.Пользователь = &Пользователь
		|	И НЕ ГруппыДоступаПользователи.Ссылка.ПометкаУдаления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ГруппыДоступаПользователи.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ГруппаДоступаПользователя
		|ИЗ
		|	Справочник.ГруппыДоступа.Пользователи КАК ГруппыДоступаПользователи
		|ГДЕ
		|	ГруппыДоступаПользователи.Пользователь = &Пользователь
		|	И НЕ ГруппыДоступаПользователи.Ссылка.ПометкаУдаления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА КоличествоГруппДоступа.Количество > 0
		|			ТОГДА ГруппаДоступаПользователя.Ссылка
		|		ИНАЧЕ &Пользователь
		|	КОНЕЦ КАК Объект
		|ПОМЕСТИТЬ ТекОбъект
		|ИЗ
		|	ГруппаДоступаПользователя КАК ГруппаДоступаПользователя,
		|	КоличествоГруппДоступа КАК КоличествоГруппДоступа
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	&Пользователь
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НастройкиУтвержденияДокументов.Согласован КАК Согласован,
		|	НастройкиУтвержденияДокументов.Утвержден КАК Утвержден,
		|	НастройкиУтвержденияДокументов.Объект КАК Объект
		|ПОМЕСТИТЬ СтатусыДокумента
		|ИЗ
		|	РегистрСведений.НастройкиУтвержденияДокументов КАК НастройкиУтвержденияДокументов
		|ГДЕ
		|	НастройкиУтвержденияДокументов.Документ = &Документ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(СтатусыДокумента.Согласован, ЛОЖЬ) КАК Согласован,
		|	ЕСТЬNULL(СтатусыДокумента.Утвержден, ЛОЖЬ) КАК Утвержден
		|ИЗ
		|	ТекОбъект КАК ТекОбъект
		|		ЛЕВОЕ СОЕДИНЕНИЕ СтатусыДокумента КАК СтатусыДокумента
		|		ПО ТекОбъект.Объект = СтатусыДокумента.Объект
		|ГДЕ
		|	ЕСТЬNULL(СтатусыДокумента.Объект, 0) <> 0";
	
	Запрос.УстановитьПараметр("Пользователь",  Пользователи.ТекущийПользователь());
	Запрос.УстановитьПараметр("Документ",      Документ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		ДоступныеСтатусы.Добавить(Перечисления.СтатусыДокументов.Подготовка, "Подготовка");
		ДоступныеСтатусы.Добавить(Перечисления.СтатусыДокументов.Подготовлен, "Подготовлен");
		
		Если Выборка.Согласован Тогда
			ДоступныеСтатусы.Добавить(Перечисления.СтатусыДокументов.Согласован, "Согласован");
		КонецЕсли;
		
		Если Выборка.Утвержден Тогда
			ДоступныеСтатусы.Добавить(Перечисления.СтатусыДокументов.Утвержден, "Утвержден");
		КонецЕсли;
		
		Если Выборка.Согласован ИЛИ Выборка.Утвержден Тогда
			ДоступныеСтатусы.Добавить(Перечисления.СтатусыДокументов.Отклонен, "Отклонен");
		КонецЕсли;
	КонецЕсли;
	
	Возврат ДоступныеСтатусы;
	
КонецФункции // ДоступныеСтатусы()
